app/controllers/root_beers_controller.rb

SELECT "root_beers".* FROM "root_beers"
---
  def index
    @root_beers = RootBeer.all

INSERT INTO "root_beers" ("created_at", "description", "name", "rating", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 15 Jan 2013 17:19:45 UTC +00:00], ["description", "Popular "], ["name", "Bark's Root Beer "], ["rating", nil], ["updated_at", Tue, 15 Jan 2013 17:19:45 UTC +00:00]]
---
  def create
    root_beer = RootBeer.new(params[:root_beer])
    root_beer.save